In [1]:
import pandas as pd
import numpy as np

In [2]:
myData = np.array(([10, 20, 30], [20, 30, 40], [20, 50, 10], [10, 15, 20]))

In [3]:
myData

array([[10, 20, 30],
       [20, 30, 40],
       [20, 50, 10],
       [10, 15, 20]])

In [4]:
monthsColumns = ["January", "February", "March"]
myNames = ["James", "Lars", "Kirk", "Rob"]

In [5]:
myDataFrame = pd.DataFrame(data=myData, columns=monthsColumns, index=myNames)

In [6]:
myDataFrame

       January  February  March
James       10        20     30
Lars        20        30     40
Kirk        20        50     10
Rob         10        15     20

In [7]:
type(myDataFrame)

pandas.core.frame.DataFrame

In [8]:
myDataFrame["February"]

James    20
Lars     30
Kirk     50
Rob      15
Name: February, dtype: int32

In [9]:
type(myDataFrame["February"])
#data frame, serilerin yanyana gelmiş halidir.

pandas.core.series.Series

In [10]:
marAvgSalary = myDataFrame["March"].mean()
marAvgSalary

25.0

In [11]:
myDataFrame.February.Kirk

50

In [12]:
myDataFrame["February"]["Kirk"]
#ikisi de aynı

50

In [13]:
myDataFrame.max()

January     20
February    50
March       40
dtype: int32

In [14]:
myDataFrame.loc["Lars"]
#loc, column'ları index olarak girilmesini sağlar

January     20
February    30
March       40
Name: Lars, dtype: int32

In [15]:
myDataFrame

       January  February  March
James       10        20     30
Lars        20        30     40
Kirk        20        50     10
Rob         10        15     20

In [16]:
myDataFrame.iloc[3]
#direkt sayı olarak index girmemizi sağlıyor.

January     10
February    15
March       20
Name: Rob, dtype: int32

In [17]:
myDataFrame["April"] = myDataFrame["March"] * 2

In [18]:
myDataFrame

       January  February  March  April
James       10        20     30     60
Lars        20        30     40     80
Kirk        20        50     10     20
Rob         10        15     20     40

In [19]:
myDataFrame.drop("Rob", axis=0)
#AXIS=0 SATIR DEMEK, AXIS=1 KOLON DEMEK

       January  February  March  April
James       10        20     30     60
Lars        20        30     40     80
Kirk        20        50     10     20

In [20]:
myDataFrame.drop("January", axis=1, inplace=True)
#inplace kalıcı olarak düşürmeye yarıyor

In [21]:
myDataFrame

       February  March  April
James        20     30     60
Lars         30     40     80
Kirk         50     10     20
Rob          15     20     40

In [22]:
boolean_frame = myDataFrame > 25

In [23]:
boolean_frame

       February  March  April
James     False   True   True
Lars       True   True   True
Kirk       True  False  False
Rob       False  False   True

In [24]:
myDataFrame[boolean_frame]

       February  March  April
James       NaN   30.0   60.0
Lars       30.0   40.0   80.0
Kirk       50.0    NaN    NaN
Rob         NaN    NaN   40.0

In [25]:
myDataFrame

       February  March  April
James        20     30     60
Lars         30     40     80
Kirk         50     10     20
Rob          15     20     40

In [26]:
myDataFrame[myDataFrame["February"] > 25]

      February  March  April
Lars        30     40     80
Kirk        50     10     20

In [27]:
myDataFrame.reset_index()
#indexleri resetleyebiliriz

   index  February  March  April
0  James        20     30     60
1   Lars        30     40     80
2   Kirk        50     10     20
3    Rob        15     20     40

In [28]:
myDataFrame["NewIndex"] = ["Jam", "Lar", "Kir", "Rob"]
myDataFrame

       February  March  April NewIndex
James        20     30     60      Jam
Lars         30     40     80      Lar
Kirk         50     10     20      Kir
Rob          15     20     40      Rob

In [29]:
myDataFrame.set_index("NewIndex")

          February  March  April
NewIndex
Jam             20     30     60
Lar             30     40     80
Kir             50     10     20
Rob             15     20     40

In [30]:
myDataFrame.drop("NewIndex", axis=1, inplace=True)
myDataFrame

       February  March  April
James        20     30     60
Lars         30     40     80
Kirk         50     10     20
Rob          15     20     40